src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>GDS_ПечатьЗапровочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереливныхВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПриходныхВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерПереливнойВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнийНомерПриходнойВедомостей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьЗаправочнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПереливнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьПриходнуюВедомость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВедомости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВедомостей</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗаправочныеВедомости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоследнийНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыДляПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаправочнаяВедомость</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.GDS_ЗаправочнаяВедомость</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВедомости</Name>
							<Type>
								<v8:Type>cfg:EnumRef.GDS_ТипыЗаправочныхВедомостей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/GDS_ПечатьЗапровочныхВедомостей/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДатаВедомостей = ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументыЗаправочныеВедомости") Тогда
		Для Каждого ЗаправочнаяВедомость Из Параметры.ДокументыЗаправочныеВедомости Цикл
			НоваяСтрока = Объект.ДокументыДляПечати.Добавить();
			НоваяСтрока.ЗаправочнаяВедомость = ЗаправочнаяВедомость;
			НоваяСтрока.ТипВедомости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗаправочнаяВедомость, "ТипВедомости");
		КонецЦикла;
		Объект.ДокументыДляПечати.Сортировать("ТипВедомости");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ДокументыДляПечати.Количество() > 0 Тогда
		ПечатьПоДокументам();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АЗСПриИзменении(Элемент)
	
	ЗаполнитьПоследниеНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриходныхПриИзменении(Элемент)
	
	ЗаполнитьПоследниеНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПереливныхПриИзменении(Элемент)
	
	ЗаполнитьПоследниеНомера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ЗаправочныеВедомости

&НаКлиенте
Процедура ЗаправочныеВедомостиКонтрагентПриИзменении(Элемент)
	
	ЗаполнитьПоследниеНомера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)
	
	Идентификаторы = Новый Массив;
	
	ДанныеДляОбработки = ДанныеДляОбработкиПоНастройкам();
	Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
		Если Идентификаторы.Найти(СтрокаДанных.Идентификатор) = Неопределено Тогда
			Идентификаторы.Добавить(СтрокаДанных.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(СтрСоединить(Идентификаторы, ","));
	
	Для Каждого СтрокаДанных Из ДанныеДляОбработки Цикл
		
		ТабличныйДокумент = ПечатьНаСервере(СтрокаДанных);
		
		Идентификатор = СтрокаДанных.Идентификатор;
		
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
		
		ПечатнаяФорма.ТабличныйДокумент     = ТабличныйДокумент;
		ПечатнаяФорма.СинонимМакета         = СтрокаДанных.ПредставлениеПечатнойФормы;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = СтрокаДанных.ПредставлениеПечатнойФормы;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПечатьПоДокументам()
	
	Идентификаторы = Новый Массив;
	
	ДанныеДляОбработки = ДанныеДляОбработкиПоДокументам();
	Для Каждого ДанниеТип Из ДанныеДляОбработки Цикл
		Идентификаторы.Добавить(ДанниеТип.Ключ);
	КонецЦикла;
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(СтрСоединить(Идентификаторы, ","));
	
	Для Каждого ДанниеТип Из ДанныеДляОбработки Цикл
		
		ТабличныйДокумент = СформироватьПечатнуюФорму(ДанниеТип.Значение);
		
		Идентификатор = ДанниеТип.Ключ;
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, Идентификатор);
		
		ПечатнаяФорма.ТабличныйДокумент     = ТабличныйДокумент;
		ПечатнаяФорма.СинонимМакета         = ДанниеТип.Значение[0].ПредставлениеПечатнойФормы;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = ДанниеТип.Значение[0].ПредставлениеПечатнойФормы;
		
	КонецЦикла;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоследниеНомера()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗаполнитьПоследниеНомера();
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ДанныеДляОбработкиПоНастройкам()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ДанныеДляОбработкиПоНастройкам();
	
КонецФункции

&НаСервере
Функция ДанныеДляОбработкиПоДокументам()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ДанныеДляОбработкиПоДокументам();
	
КонецФункции

&НаСервере
Функция ПечатьНаСервере(СтрокаДанных)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = Обработка.Обработать(СтрокаДанных);
	ЗначениеВРеквизитФормы(Обработка, "Объект");
	
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция СформироватьПечатнуюФорму(Знач Ведомости)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.СформироватьПечатнуюФорму(Ведомости);
	
КонецФункции

#КонецОбласти
